# >>> TAPS >>>

# Defaults
tap "homebrew/bundle"

# Fonts
tap "homebrew/cask-fonts"

# >>> CORE FORMULAE >>>

# Shell
brew "bat"
brew "exa"
brew "fzf"
brew "gh"
brew "git"
brew "jq"
brew "starship"
brew "tmux"
brew "zoxide"

# Languages
brew "node"
brew "python"

# Neovim
brew "fd"
brew "gnu-sed"
brew "lazygit"
brew "ripgrep"
brew "tree-sitter"
brew "neovim"

# >>> CASK FORMULAE >>>

# Apps
cask "arc"
cask "discord"
cask "spotify"

# Fonts
cask "font-fira-code-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-hack-nerd-font"

# Programming
cask "docker"
cask "iterm2"
cask "visual-studio-code"

# Utils
cask "1password"
cask "alfred"
cask "vanilla"
