# >>> TAPS >>>

# Defaults
tap "homebrew/bundle"

# Fonts
tap "homebrew/cask-fonts"

# >>> CORE FORMULAE >>>

# Shell
brew "bat"
brew "colima"
brew "docker"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "httpie"
brew "jq"
brew "lazygit"
brew "starship"
brew "zoxide"
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions"

# Languages
brew "node"
brew "python"

# >>> CASK FORMULAE >>>

# Apps
cask "brave-browser"
cask "ghostty"
cask "spotify"
cask "visual-studio-code"

# Fonts
cask "font-0xproto-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-hack-nerd-font"

# Utils
cask "1password"
cask "alfred"
cask "vanilla"
