# >>> TAPS >>>

# default taps
tap "homebrew/bundle"
tap "homebrew/cask"

# custom taps
tap "homebrew/cask-fonts"

# >>> CORE FORMULAE >>>

brew "awscli"
brew "bat"
brew "exa"
brew "git"
brew "neovim"
brew "node"
brew "python"
brew "ripgrep"
brew "starship"
brew "tmux"

# >>> CASK FORMULAE >>>

cask "1password"
cask "alfred"
cask "discord"
cask "docker"
cask "font-0xproto-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-geist-mono-nerd-font"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "iterm2"
cask "rocket"
cask "spotify"
cask "vanilla"
cask "visual-studio-code"

# >>> MISC >>>
brew "java11"   # Java 11 is stable
brew "maven"    # Apache Maven
